Revit 2027 API
DuctSizeSettings.GetDuctSizeSettingIterator Method
Returns a DuctSizeSettingIterator object that iterates through the collection.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DuctSizeSettingIterator GetDuctSizeSettingIterator()
Public Function GetDuctSizeSettingIterator As DuctSizeSettingIterator
public:
DuctSizeSettingIterator^ GetDuctSizeSettingIterator()
member GetDuctSizeSettingIterator : unit -> DuctSizeSettingIterator
Return Value
DuctSizeSettingIterator
A DuctSizeSettingIterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace